# CreateRecommendedTypeForSet Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AlignmentStationLabel..::..CreateRecommendedTypeForSet Method
AlignmentStationLabel Class See Also
---
Creates an element type recommended for alignment label sets and returns its ElementId.
**Namespace:** Autodesk.Revit.DB.Infrastructure**Assembly:** Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public static ElementId CreateRecommendedTypeForSet(
	Document document
)
```

Visual Basic
---
```text
Public Shared Function CreateRecommendedTypeForSet ( _
	document As Document _
) As ElementId
```

Visual C++
---
```text
public:
static ElementId^ CreateRecommendedTypeForSet(
	Document^ document
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..DocumentThe document in which the type will be created.
# Remarks
The crucial features of the label type recommended for sets are: \- rotate with component \- vertical text \- label display includes station value \- leader arrow head has type "Heavy End Tick Mark"
# See Also
AlignmentStationLabel Class
Autodesk.Revit.DB.Infrastructure Namespace